# Missing values

In [1]:
import numpy as np
import pandas as pd

In [2]:
d={"A":(1,2,np.nan),"B":[1,np.nan,np.nan],"C":[1,2,3]}

In [3]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna() # along column

     A    B  C
0  1.0  1.0  1

In [5]:
df.dropna(axis=1) #along row

   C
0  1
1  2
2  3

In [6]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna(thresh=2)  # minimum amount of nan valuse req to drop the column

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [8]:
df.fillna("Fill")

      A     B  C
0     1     1  1
1     2  Fill  2
2  Fill  Fill  3

In [9]:
df.fillna(df["A"].mean())    #mean value filled

     A    B  C
0  1.0  1.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Groupby

In [10]:
data={"company":"GOOG GOOG MSFT MSFT FB FB".split(),
      "person":"Sam Charlie Amy Shelby Holems Sundar".split(),
     "sales":(22,120,340,124,243,350)}

In [11]:
df=pd.DataFrame(data)
df

  company   person  sales
0    GOOG      Sam     22
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Shelby    124
4      FB   Holems    243
5      FB   Sundar    350

In [12]:
hh=df.groupby("company")
hh.sum()

         sales
company
FB         593
GOOG       142
MSFT       464

In [13]:
hh.mean()

         sales
company
FB       296.5
GOOG      71.0
MSFT     232.0

In [14]:
df.sales.sum()

1199

In [15]:
df

  company   person  sales
0    GOOG      Sam     22
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Shelby    124
4      FB   Holems    243
5      FB   Sundar    350

In [16]:
df.groupby("company").sum().loc["FB"]

sales    593
Name: FB, dtype: int64

In [17]:
df.groupby("company").count()

         person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [18]:
df.groupby("company").describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0   71.0   69.296465   22.0   46.50   71.0   95.50  120.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
df.groupby("company").describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000   71.000000  232.000000
      std     75.660426   69.296465  152.735065
      min    243.000000   22.000000  124.000000
      25%    269.750000   46.500000  178.000000
      50%    296.500000   71.000000  232.000000
      75%    323.250000   95.500000  286.000000
      max    350.000000  120.000000  340.000000

# Merging, Joining and Concatination

In [20]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [21]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [22]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [23]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [24]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [25]:
left=pd.DataFrame({'A':("A0 A1 A2 A3".split()),
              'B':("B0 B1 B2 B3".split()),
              "key":("K0 K1 K2 K3".split())})

In [26]:
right=pd.DataFrame({'C':("C0 C1 C2 C3".split()),
              'D':("D0 D1 D2 D3".split()),
              "key":("K0 K1 K2 K3".split())})

In [27]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [28]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [29]:
pd.merge(left,right,how='inner',on="key")   # merge key se hoota hai

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [30]:
left1=pd.DataFrame({'A':("A0 A1 A2 A3".split()),
              'B':("B0 B1 B2 B3".split())},
              index="K0 K1 K2 K3".split())

In [31]:
right1=pd.DataFrame({'C':("C0 C1 C2 C3".split()),
              'D':("D0 D1 D2 D3".split())},
              index="K0 K1 K2 K3".split())

In [32]:
left1.join(right1)                               #join index se hoota hai

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

# Operations

In [33]:
df=pd.DataFrame({"Col1":(1,2,3,4),
               "Col2":(444,555,666,555),
               "Col3":"abc def ghi xyz".split()})

In [34]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   555  xyz

In [35]:
len(df["Col2"].unique())

3

In [36]:
df["Col2"].value_counts()

555    2
666    1
444    1
Name: Col2, dtype: int64

In [37]:
def myfunc(a):
    return a*2

In [38]:
df["Col2"].apply(myfunc)      #used to apply user function

0     888
1    1110
2    1332
3    1110
Name: Col2, dtype: int64

In [39]:
df["Col2"].apply(lambda x:x+2)     #lambda expression used.

0    446
1    557
2    668
3    557
Name: Col2, dtype: int64

In [40]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [41]:
df.sort_values("Col2")    #sorted

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
3     4   555  xyz
2     3   666  ghi

In [44]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [46]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [48]:
df.pivot_table("D",["A","B"],"C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN